tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2321_tdd.h
#define NOT_PD                        522
#define PD                            523
#define NOT_TO                        524
#define nTO                           525
#define TO                            526
#define nRI                           527
#define NOT_RI                        528
#define RI                            529
#define SBOREN                        530
#define IPEN                          531
#define WDTCON                        532
#define SWDTE                         533
#define SWDTEN                        534
#define HLVDCON                       535
#define HLVDL                         536
#define HLVDL0                        537
#define LVV0                          538
#define LVDL0                         539
#define HLVDL1                        540
#define LVV1                          541
#define LVDL1                         542
#define HLVDL2                        543
#define LVV2                          544
#define LVDL2                         545
#define HLVDL3                        546
#define LVV3                          547
#define LVDL3                         548
#define HLVDEN                        549
#define LVDEN                         550
#define BGST                          551
#define IRVST                         552
#define VDIRMAG                       553
#define OSCCON                        554
#define SCS0                          555
#define SCS                           556
#define SCS1                          557
#define FLTS                          558
#define IOFS                          559
#define OSTS                          560
#define IRCF                          561
#define IRCF0                         562
#define IRCF1                         563
#define IRCF2                         564
#define IDLEN                         565
#define T0CON                         566
#define T0PS                          567
#define T0PS0                         568
#define T0PS1                         569
#define T0PS2                         570
#define PSA                           571
#define T0SE                          572
#define T0CS                          573
#define T08BIT                        574
#define T016BIT                       575
#define TMR0ON                        576
#define STATUS                        577
#define C                             578
#define CARRY                         579
#define DC                            580
#define ZERO                          581
#define Z                             582
#define OV                            583
#define OVERFLOW                      584
#define N                             585
#define NEGATIVE                      586
#define INTCON3                       587
#define INT1IF                        588
#define INT1F                         589
#define INT2IF                        590
#define INT2F                         591
#define INT1E                         592
#define INT1IE                        593
#define INT2IE                        594
#define INT2E                         595
#define INT1P                         596
#define INT1IP                        597
#define INT2IP                        598
#define INT2P                         599
#define INTCON2                       600
#define RBIP                          601
#define TMR0IP                        602
#define INTEDG2                       603
#define INTEDG1                       604
#define INTEDG0                       605
#define RBPU                          606
#define NOT_RBPU                      607
#define nRBPU                         608
#define INTCON                        609
#define RBIF                          610
#define INT0F                         611
#define INT0IF                        612
#define T0IF                          613
#define TMR0IF                        614
#define RBIE                          615
#define INT0E                         616
#define INT0IE                        617
#define T0IE                          618
#define TMR0IE                        619
#define PEIE                          620
#define PEIE_GIEL                     621
#define GIEL                          622
#define GIE_GIEH                      623
#define GIE                           624
#define GIEH                          625
#define SP0                           626
#define STKPTR                        627
#define SP1                           628
#define SP2                           629
#define SP3                           630
#define SP4                           631
#define STKUNF                        632
#define STKOVF                        633
#define STKFUL                        634

#endif // _PIC18F2321_H_
